testCases/03_add_models_for_solid_body/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pcorr)"
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.1;
        smoother        symGaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 5;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    "(pFinal|pcorrFinal)"
    {
        $p;
        tolerance       1e-12;
        relTol          0;
    }

    "(U|k|epsilon|omega|R|nuTilda)"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0.05;
    }
    "(U|k|epsilon|omega|R|nuTilda)Final"
    {
        solver          PBiCG;
        preconditioner   DILU;
        tolerance       1e-12;
        relTol          0;
    }
}

PISO
{
    nCorrectors     4;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    5;
    nCorrectors         3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
    
    consistent         no;
    
    outerCorrectorResidualControl
    {
        p
        {
            tolerance   1e-05;
            relTol      0;
        }
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 3;
    residualControl
    {
        p	1e-6;
        U	1e-6;
    }
    pRefCell 101;
    pRefValue 0;
    consistent yes;
}

relaxationFactors
{
    fields
    {
        p           0.8;
        
        pFinal      1;
    }
    equations
    {
        ".*" 1;
    }
}

cache
{
    grad(U);
}
// ************************************************************************* //
